PROJETO_TCC/views/curso/view.php


    <?php

    $count = \app\models\GradeCurso::find()->where(['id_Curso' => $model->id_Curso])->count();
---
SELECT COUNT(*) FROM `grade_curso` WHERE `id_Curso`=1