PROJETO_TCC/views/aula-semestral/view.php


    <?php

    $count = AulaSemestral::find()->where([
        'id_Curso' => $model->id_Curso,
        'id_Periodo' => $model->id_Periodo,
        'id_Disciplina' => $model->id_Disciplina,
        'id_Professor' => $model->id_Professor,
        'turno' => $model->turno,
        'data_inicio' => $model->data_inicio,
        'data_fim' => $model->data_fim
    ])->count();
---
SELECT COUNT(*) FROM `aulasemestral` WHERE (`id_Curso`=1) AND (`id_Periodo`=1) AND (`id_Disciplina`=1) AND (`id_Professor`=1) AND (`turno`='1') AND (`data_inicio`='0000-00-00') AND (`data_fim`='0000-00-00')