PROJETO_TCC/controllers/AulaSemestralController.php

    protected function findModel($id_Curso, $id_Periodo, $id_Disciplina, $turno, $data_inicio, $data_fim)
    {
        if (($model = AulaSemestral::findOne(['id_Curso' => $id_Curso, 'id_Periodo' => $id_Periodo, 'id_Disciplina' => $id_Disciplina, 'turno' => $turno, 'data_inicio' => $data_inicio, 'data_fim' => $data_fim])) !== null) {
---
SELECT * FROM `aulasemestral` WHERE (`id_Curso`='1') AND (`id_Periodo`='1') AND (`id_Disciplina`='1') AND (`turno`='1') AND (`data_inicio`='0000-00-00') AND (`data_fim`='0000-00-00')